# Compound Structure Layer(Double, Material Function Assignment, Element Id) Constructor

Source: https://www.revitapidocs.com/2026/90c2ea06-4e80-c8c0-dbde-1b3f831c2de5.htm

---

| Compound Structure Layer(Double, Material Function Assignment, Element Id) Constructor |
| --- |

Creates a default compound structure layer based on the given width, function and material element id. The priority is initialized with 999\.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public CompoundStructureLayer(
	double width,
	MaterialFunctionAssignment function,
	ElementId materialId
)
```

```
Public Sub New (
	width As Double,
	function As MaterialFunctionAssignment,
	materialId As ElementId
)
```

```
public:
CompoundStructureLayer(
	double width,
	MaterialFunctionAssignment function,
	ElementId^ materialId
)
```

```
new :
        width : float *
        function : MaterialFunctionAssignment *
        materialId : ElementId -> CompoundStructureLayer
```

#### Parameters

width Double
:   The width of the layer.

function MaterialFunctionAssignment
:   The function of the layer.

materialId ElementId
:   The material element id of the layer.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

CompoundStructureLayer Class CompoundStructureLayer Overload Autodesk.Revit.DB Namespace